-- Не менее 8 исполнителей
INSERT INTO performers 
VALUES 
(1, 'Бетховен'),
(2, 'Джузеппе Верди'),
(3, 'Луис Армстронг'),
(4, 'Валерий Меладзе'),
(5, 'Валерия'),
(6, 'Дмитрий Билан'),
(7, 'Дмитрий Маликов'),
(8, 'Пелагея');

--не менее 5 жанров
INSERT INTO genres
VALUES 
(1, 'Классика'),
(2, 'Джаз'),
(3, 'Эстрада'),
(4, 'Инструментальная'),
(5, 'Фолк');

--связующая таблица исполнителей и жанров
INSERT INTO genres_performers
VALUES 
(1, 1, 1),
(2, 4, 1),
(3, 1, 2),
(4, 4, 2),
(5, 2, 3),
(6, 3, 4),
(7, 3, 5),
(8, 3, 6),
(9, 3, 7),
(10, 4, 7),
(11, 5, 8),
(12, 3, 8);

--не менее 8 альбомов
INSERT INTO albums  
VALUES 
(1, 'Полста', 2016),
(2, 'Мой брат', 2015),
(3, 'Нежность моя', 2020),
(4, 'К солнцу', 2018),
(5, 'Молния', 2018),
(6, 'Мир пополам', 2021),
(7, 'Игра', 2019),
(8, 'Тропы', 2009),
(9, 'Hello Louis', 2010),
(10, 'Классика', 2020);


--связующая таблица исполнителей и альбомов
INSERT INTO performers_albums
VALUES 
(1, 4, 1),
(2, 4, 2),
(3, 5, 3),
(4, 5, 4),
(5, 6, 5),
(6, 7, 6),
(7, 7, 7),
(8, 8, 8),
(9, 3, 9),
(10, 1, 10),
(11, 2, 10);

--не менее 15 треков
INSERT INTO tracks  
VALUES 
(1, 'Сэра', '3:52', 1),
(2, 'Мой брат', '3:53', 2),
(3, 'Река времени', '4:25', 1),
(4, 'Let my people go', '3:56', 9),
(5, 'Moon River', '3:23', 9),
(6, 'Космос', '3:17', 4),
(7, 'Сердце', '3:29', 4),
(8, 'Полёт', '4:04', 3),
(9, 'Молния', '3:59', 5),
(10, 'Последний романтик', '4:00', 6),
(11, 'Все будет', '2:55', 6),
(12, 'Летний дождь', '4:06', 7),
(13, 'Не для тебя', '3:52', 8),
(14, 'Степь', '4:16', 8),
(15, 'Пташечка', '5:42', 8),
(16, 'К Элизе', '2:44', 10),
(17, 'Набукко', '7:13', 10),
(18, 'Лунная соната', '5:07', 10);

--не менее 8 сборников
INSERT INTO collections 
VALUES 
(1, 'Первый', 2001),
(2, 'Второй', 2002),
(3, 'Третий', 2005),
(4, 'Четвертый', 2007),
(5, 'Пятый', 2018),
(6, 'Шестой', 2019),
(7, 'Седьмой', 2021),
(8, 'Восьмой', 2022);

--связующая таблица треков и коллекций
INSERT INTO tracks_collections
VALUES 
(1, 1, 1),
(2, 1, 2),
(3, 2, 3),
(4, 2, 4),
(5, 3, 5),
(6, 3, 6),
(7, 4, 7),
(8, 5, 8),
(9, 6, 1),
(10, 7, 2),
(11, 8, 3),
(12, 9, 4),
(13, 9, 5),
(14, 11, 6),
(15, 12, 7),
(16, 15, 8),
(17, 17, 1),
(18, 18, 2),
(19, 13, 3),
(20, 14, 4),
(21, 14, 5),
(22, 18, 6);